pipeDeniAtmojoo/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: your_version_here                      |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeaturesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

extractionMethod extractFromSurface;

extractFromSurfaceCoeffs
{
    includedAngle   150;
    writeObj        yes;
}

surfaces
(
    "partOne.stl"
);

writeDirectory "constant/geometry";
